Boundary_Test_InletOutlet/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
   "(inletWater)"
    {
        type            fixedFluxPressure;
    }
    
    outlet
    {
        type            fixedFluxPressure;

    }


    outletAir1
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
 
  

    "(right|left|inletWall|bottom|interface2)"
    {
        type            fixedFluxPressure;
    }



     lid 
    {
        type            totalPressure;
        p0              uniform 0;
    }


}

// ************************************************************************* //
