Boundary_Test_InletOutlet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    outlet
    {
        type            patch;
        nFaces          10800;
        startFace       834300;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8100;
        startFace       845100;
    }
    lid
    {
        type            patch;
        nFaces          8100;
        startFace       853200;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2250;
        startFace       861300;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2250;
        startFace       863550;
    }
    interface2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1800;
        startFace       865800;
    }
    inletWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          360;
        startFace       867600;
    }
    inletWater
    {
        type            patch;
        nFaces          90;
        startFace       867960;
    }
)

// ************************************************************************* //
