Boundary_Test_InletOutlet/system/blockMeshDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0  0   0)
    (10 0   0)
    (10 50  0)
    (0  50  0)
    (0  0  10)
    (10 0  10)
    (10 50 10)
    (0  50 10)
    
    (0  50  0)
    (10 50  0)
    (10 60  0)
    (0  60  0)
    (0  50 10)
    (10 50 10)
    (10 60 10)
    (0  60 10)
    
    (0  50 -5)
    (10 50 -5)
    (10 60 -5)
    (0  60 -5)
    (0  50  0)
    (10 50  0)
    (10 60  0)
    (0  60  0)
 
);

blocks
(
    hex ( 0  1  2  3  4  5  6  7) (20 100 20) simpleGrading (1 1 1)
    hex ( 8  9 10 11 12 13 14 15) (20 20 20) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) (20 20 10) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 1 5 4) //inlet 1
    )
    patch outlet
    (
        (10 11 15 14) //outlet 2
        (8 12 15 11) //patch right 2
        (9 10 14 13) //patch left 2
        
        (18 19 23 22) //outlet 3
        (16 20 23 19) //patch right 3
        (17 18 22 21) //patch left 3
    )
    wall bottom
    (
        (0 3 2 1) //bottom 1
        (16 19 18 17) //bottom 3
        (16 17 21 20) //inlet 3
    )
    patch lid
    (
        (4 5 6 7) //lid 1
        (12 13 14 15) //lid 2

    )
    patch right
    (
        (0 4 7 3) //right 1
    )
    patch left
    (
        (1 2 6 5) //left 1
        
    )
    
    patch interface1
    (
        (2 3 7 6) //outlet 1
    )
    
    patch interface2
    (
        (8 9 13 12) //inlet 2
    )
    
      patch interface3
    (
        (8 11 10 9) //bottom 2
    )
    
    patch interface4
    (
        (20 21 22 23) //lid 3
    ) 
    
);

mergePatchPairs
(
  (interface1 interface2)
  (interface3 interface4)
);

// ************************************************************************* //
