Boundary_Test_InletOutlet/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         90;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   .1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   7;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           0.9;
maxAlphaCo      0.9;

maxDeltaT       1;


functions
{
    waterOutlet
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        log             false;
        regionType      patch;
        name            outlet;
        operation       sum;
        fields
        (
            alphaPhi0.water
        );
    }
    interfaceHeight1
    {
        type           interfaceHeight;
        libs           ("libfieldFunctionObjects.so");
        alpha          alpha.water;
        locations      (
            (-10.001 0.001 -5.001)
            (-20.001 0.001 -5.001)
            (-30.001 0.001 -5.001)
            (-40.001 0.001 -5.001)
            (-50.001 0.001 -5.001)
        );
    }
}

// ************************************************************************* //
