Boundary_Test_InletOutlet/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// What to extrude:
//      patch   : from patch of another case ('sourceCase')

constructFrom patch;
sourceCase ".";
sourcePatches (right);

// If construct from patch: patch to use for back (can be same as sourcePatch)
exposedPatchName left;

// Flip surface normals before usage.
flipNormals true;

//- Linear extrusion in point-normal direction
extrudeModel        linearDirection;

nLayers             1;
expansionRatio      1.0;
linearDirectionCoeffs
{
    direction       (1 0 0);
    thickness       1.0;
}


// Do front and back need to be merged? Usually only makes sense for 360
// degree wedges.
mergeFaces false;
mergeTol 0.00001;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //