Boundary_Test_InletOutlet/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
actions
(
    {
        name    inletWater;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0 -0.1 0) (10.1 0.1 1); 
        }
    }
    {
        name    inletWall;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0 -0.1 1) (10.1 .1 10); 
        }
    }

);

// ************************************************************************* //